city_list = {
    "а": [
        "архангельск", "азов", "астрахань", "абакан", "адыгейск", "алушта", "амурск", "анапа",
        "арзамас", "арсеньев", "ангарск", "алтай", "атланта", "ачинск", "александровск", "алушта",
        "авдеевка", "агидель", "алдан", "адыгейск", "андропов", "артем", "алейск", "анжи", "амур"
    ],
    "б": [
        "барнаул", "белгород", "брянск", "бахчисарай", "байконур", "барабинск", "бугульма", "бор",
        "благовещенск", "борисоглебск", "бордума", "беслан", "бутурлиновка", "белово", "байдар", "боровск",
        "бердск", "балаково", "благовещенск", "бугульма", "белебей", "башмаково"
    ],
    "в": [
        "владивосток", "волгоград", "воронеж", "вологда", "владикавказ", "верхняя пышма", "великий новгород",
        "вязники", "воскресенск", "владимир", "волхов", "валаам", "великий устюг", "волжский", "высоцк", "вологда"
    ],
    "г": [
        "грозный", "глазов", "гомель", "горноалтайск", "горноуральск", "геническ", "гатчина", "герцен", "грязи",
        "германия", "гревель", "гусев", "гусиноозерск", "гатчина", "губаха", "голицыно"
    ],
    "д": [
        "донецк", "дмитров", "дзержинск", "дорогобуж", "дербент", "детчино", "дальнереченск", "далматово", "девяткино",
        "дубна", "дудинка", "долгопрудный", "димитровград", "девица", "дуров", "долинск"
    ],
    "е": [
        "екатеринбург", "елец", "ессентуки", "елизаветполь", "евпатория", "ефремов", "егорьевск", "енакиево",
        "ейск", "еленджик", "евпатория", "еланец", "ею", "ежевск", "есеновский"
    ],
    "ж": [
        "жигулевск", "железногорск", "жуковский", "женк", "жмеринка", "жлобин", "жданов", "жирновск"
    ],
    "з": [
        "зеленоград", "заводоуковск", "забайкальск", "звенигород", "зеленый гай", "златоуст", "замятино", "золин"
    ],
    "и": [
        "иркутск", "иваново", "ижевск", "инта", "ишим", "избербаш", "иннополис", "изобильный", "идрицк",
        "илинский", "индустриальный", "изис"
    ],
    "к": [
        "казань", "калуга", "краснодар", "калининград", "кемерово", "кострома", "курск", "ковров", "королев", "киров",
        "курган", "красноярск", "каспийск", "кострома", "комсомольск-на-амуре", "колпино", "крымск"
    ],
    "л": [
        "липецк", "луга", "ливны", "лобня", "ломоносов", "лениногорск", "ликино дулево", "лакокрасный",
        "левашов", "лимон", "луначарский", "лебедевка"
    ],
    "м": [
        "москва", "мурманск", "магнитогорск", "махачкала", "минск", "миасс", "муром", "майкоп", "минеральные воды", "моздок",
        "муром", "матушкино", "малоярославец", "мокроус"
    ],
    "н": [
        "норильск", "нижний новгород", "набережные челны", "невинномысск", "новосибирск", "нижнекамск", "новороссийск",
        "нижний тагил", "нахабино", "ногинск", "начало", "непокоренная"
    ],
    "о": [
        "омск", "оренбург", "одинцово", "орехово зуево", "обнинск", "отрадный", "октябрьский", "огарев", "октябрьская",
        "обнинск", "орел"
    ],
    "п": [
        "пермь", "петрозаводск", "пятигорск", "псков", "пенза", "прокопьевск", "почеп", "подольск", "печора", "приморск",
        "петропавловск", "пинск", "покров", "пуховка", "пруд", "петров"
    ],
    "р": [
        "ростов на дону", "рязань", "реутов", "рыбинск", "россошь", "рим", "рогачев", "русе", "рамонь", "радужный"
    ],
    "с": [
        "санкт петербург", "самара", "сочи", "саратов", "смоленск", "ставрополь", "саранск", "севастополь", "серпухов", "сосновый бор",
        "сургут", "салехард", "славянск на кубани", "сыктывкар", "саянск", "свердловск"
    ],
    "т": [
        "томск", "тула", "тверь", "таганрог", "тихвин", "тамбов", "туапсе", "тюмень", "тольятти"
    ],
    "у": [
        "уфа", "ульяновск", "уссурийск", "улан удэ", "усть каменогорск", "узловая", "усть луга", "учкекен"
    ],
    "ф": [
        "феодосия", "фрязино", "флоренция", "фастов", "федоровка"
    ],
    "х": [
        "хабаровск", "химки", "ханты мансийск", "холм", "хороль", "холмск", "химки", "хырси"
    ],
    "ц": [
        "цимлянск", "центр"
    ],
    "ч": [
        "челябинск", "черкесск", "чебоксары", "чистополь", "чайковский", "чудово", "чапаевск", "чагода"
    ],
    "ш": [
        "шадринск", "шахты", "шимск", "шумерля", "шарья", "шахтерск", "шилка"
    ],
    "щ": [
        "щелково", "щигры", "щукино", "щелково"
    ],
    "э": [
        "элиста", "энгельс", "эппинг", "эстон", "этна"
    ],
    "ю": [
        "южно сахалинск", "южноуральск", "юрга", "южный", "южно-сахалинск", "юкка"
    ],
    "я": [
        "ярославль", "якутск", "ялта", "ямбург", "ясногорск", "яранск", "янтарь"
    ]
}
