adjectives = {
    "m": [
        "Хентайный", "Сальный", "Похотливый", "Фетишный", "Грязный", "Развратный",
        "Извращенный", "Сладострастный", "Соблазнительный", "Страстный", "Яойный",
        "Доминирующий", "Порочный", "Ласковый", "Грубый", "Одержимый", "Распущенный",
        "Жаркий", "Чувственный", "Гипнотический", "Вожделенный", "Опасный", "Дьявольский",
        "Похотный", "Дразнящий", "Обнажённый", "Искушённый", "Скрученный", "Тентаклевый",
        "БДСМ-шный", "Проклятый", "Эксгибиционистский", "Маньячный", "Ванильно-грязный",
        "Секс-машиновидный", "Лубрикантный", "Флиртующий", "Стриптизёрский", "Перверзный"
    ],
    "f": [
        "Сексуальная", "Влажная", "Похотливая", "Горячая", "Развратная", "Грязная",
        "Сладострастная", "Соблазнительная", "Страстная", "Извращенная", "Фетишная",
        "Ласковая", "Податливая", "Порочная", "Распущенная", "Чувственная", "Манящая",
        "Гипнотическая", "Дразнящая", "Наглая", "Огненная", "Откровенная", "Приторная",
        "Опасная", "Вожделенная", "Искусительная", "Сладко-кислая", "Мокренькая",
        "Стриптизёрская", "Сквозь-бельё-видная", "БДСМ-шная", "Эро-кошмеарная",
        "Ванильно-нежная", "Обольстительная", "Импульсивная", "Шёлково-постельная",
        "Секс-куколкоподобная", "Перверзная", "Истекающая-соком"
    ]
}

nouns = {
    "m": [
        "Гоку", "Наруто", "Итачи", "Лелуш", "Камина", "Саске", "Лайт", "Эрен",
        "Рой Мустанг", "Эдвард Элрик", "Себастьян Михаэлис", "Канаме Тосен",
        "Танджиро", "Гильгамеш", "Мадара", "Тоторо", "Генос", "Алукард",
        "Синигами Рюук", "Дио Брандо", "Кен Канэки", "Ван Хелсинг", "Синдзи Икари",
        "Трафальгар Ло", "Аскаелон", "Вегета", "Тодороки Шото", "Годзилла",
        "Кеншин Химура", "Киллуа Золдик", "Сайтама", "Спайк Шпигель", "Лэнгрисер",
        "Хаджиме Но Идзуку", "Иори Ягуми", "Джозеф Джостар", "Коя Армия", "Кацуки Бакуго",
        "Рендзи Абараи", "Гинтоки Саката", "Ринго Амамия", "Джотро Куджо"
    ],
    "f": [
        "Рем", "Рам", "Хината Хьюга", "Мику Накасэ", "Аска Лэнгли", "Сакура Харуно",
        "Цунаде", "Курису Макисэ", "Кагуя Шиномия", "Мадока Канамэ", "Миса Амане",
        "Фудзивара Тихая", "Киришима Тоука", "Люси Хартфилия", "Шелли", "Шана",
        "Ёруити Шихоин", "Кушина Узумаки", "Сацуки Кирюин", "Котоноха Кацура",
        "Сейлор Мун", "Ре Лейен", "Шинобу Кочоу", "Элизабет Лайонесс", "Чунь Ли",
        "Хитоми Танака", "Ранг Матои", "Мирай Курияма", "Юки Асамура", "Рей Аянами",
        "Фубуки", "Тацумаки", "Мелиодас Элиза", "Люминис Валтирес", "Канна Камуи",
        "Зеро Ту", "Химари Тодо", "Эрис Бореас Грейрат", "Синобу Ошино"
    ]
}
