GENRES = {
    # -----action----- (1)
    'action': 1,
    'экшен': 1,
    'экшн': 1,
    'акшен': 1,
    'боевик': 1,
    'боевики': 1,
    'экшен‑фильм': 1,
    'акшен‑боевик': 1,

    # -----adventure----- (2)
    'adventure': 2,
    'приключения': 2,
    'приключение': 2,
    'приключенческий': 2,
    'приключенческий фильм': 2,
    'приключенческий экшен': 2,

    # -----racing----- (3)
    'racing': 3,
    'гонки': 3,
    'гонка': 3,
    'автогонки': 3,
    'гонка на машинах': 3,
    'гоночные': 3,

    # -----comedy----- (4)
    'comedy': 4,
    'комедия': 4,
    'юмор': 4,
    'комедийный': 4,
    'комедийное': 4,
    'комедийный фильм': 4,
    'смешной': 4,

    # -----avant garde----- (5)
    'avant garde': 5,
    'авангаррд': 5,
    'авангард': 5,
    'авантгард': 5,
    'авангардный': 5,
    'необычный': 5,
    'культовый': 5,

    # -----mythology----- (6)
    'mythology': 6,
    'мифология': 6,
    'мифы': 6,
    'древнегреческие мифы': 6,
    'мифология древних': 6,
    'легенды': 6,

    # -----mystery----- (7)
    'mystery': 7,
    'тайна': 7,
    'загадка': 7,
    'мистика': 7,
    'неразгаданное': 7,

    # -----drama----- (8)
    'drama': 8,
    'драма': 8,
    'драмма': 8,
    'драматическое': 8,
    'эмоциональное': 8,
    'драмеди': 8,

    # -----ecchi----- (9)
    'ecchi': 9,
    'этти': 9,
    'эччи': 9,
    'эти': 9,
    'сексуальный': 9,

    # -----fantasy----- (10)
    'fantasy': 10,
    'фэнтези': 10,
    'фентези': 10,
    'фэнтези‑мир': 10,
    'магия': 10,
    'сказка': 10,

    # -----strategy game----- (11)
    'strategy game': 11,
    'стратегические игры': 11,
    'стратегия': 11,
    'игры‑стратегии': 11,

    # -----hentai----- (12)
    'hentai': 12,
    'хентай': 12,
    'эротика': 12,
    'японская эротика': 12,

    # -----historical----- (13)
    'historical': 13,
    'исторический': 13,
    'история': 13,
    'исторический фильм': 13,

    # -----horror----- (14)
    'horror': 14,
    'ужасы': 14,
    'страшилки': 14,
    'тревожный': 14,
    'пугающий': 14,

    # -----kids----- (15)
    'kids': 15,
    'детское': 15,
    'для детей': 15,
    'детская анимация': 15,

    # -----martial arts----- (17)
    'martial arts': 17,
    'боевые искусства': 17,
    'марциальные искусства': 17,

    # -----mecha----- (18)
    'mecha': 18,
    'меха': 18,
    'роботы': 18,
    'механические роботы': 18,

    # -----music----- (19)
    'music': 19,
    'музыка': 19,
    'музыкальные': 19,
    'музыкальный жанр': 19,

    # -----parody----- (20)
    'parody': 20,
    'пародия': 20,
    'сатира': 20,
    'пародиальные': 20,

    # -----samurai----- (21)
    'samurai': 21,
    'самураи': 21,
    'японские самураи': 21,
    'воин': 21,

    # -----romance----- (22)
    'romance': 22,
    'романтика': 22,
    'любовь': 22,
    'романтическое': 22,

    # -----school----- (23)
    'school': 23,
    'школа': 23,
    'учебное заведение': 23,
    'учёба': 23,
    'учеба': 23,

    # -----sci-fi----- (24)
    'sci‑fi': 24,
    'научная фантастика': 24,
    'научное фэнтези': 24,
    'фантастика': 24,

    # -----shoujo----- (25)
    'shoujo': 25,
    'сёдзё': 25,
    'девушки': 25,
    'аниме для девушек': 25,

    # -----shounen----- (27)
    'shounen': 27,
    'сёнен': 27,
    'мальчики': 27,
    'аниме для мальчиков': 27,

    # -----space----- (29)
    'space': 29,
    'космос': 29,
    'пространство': 29,
    'космическое': 29,

    # -----sports----- (30)
    'sports': 30,
    'спорт': 30,
    'спортивное': 30,
    'спортивные игры': 30,

    # -----super power----- (31)
    'super power': 31,
    'супер сила': 31,
    'сверхспособности': 31,
    'супергерой': 31,

    # -----vampire----- (32)
    'vampire': 32,
    'вампиры': 32,
    'кровопийцы': 32,
    'вампиризм': 32,

    # -----yaoi----- (33)
    'yaoi': 33,
    'яой': 33,
    'блу': 33,
    'японский гей': 33,

    # -----yuri----- (34)
    'yuri': 34,
    'юри': 34,
    'лесбиянки': 34,
    'аниме о любви между девушками': 34,

    # -----harem----- (35)
    'harem': 35,
    'гарем': 35,
    'полиамория': 35,
    'многоженство': 35,

    # -----slice of life----- (36)
    'slice of life': 36,
    'повседневность': 36,
    'жизнь': 36,
    'поворот жизни': 36,

    # -----supernatural----- (37)
    'supernatural': 37,
    'сверхъестественное': 37,
    'необъяснимое': 37,
    'мистическое': 37,

    # -----military----- (38)
    'military': 38,
    'военное': 38,
    'армия': 38,
    'солдаты': 38,

    # -----detective----- (39)
    'detective': 39,
    'детектив': 39,
    'расследование': 39,
    'криминал': 39,

    # -----psychological----- (40)
    'psychological': 40,
    'психологическое': 40,
    'психология': 40,
    'психоанализ': 40,

    # -----seinen----- (42)
    'seinen': 42,
    'сэйнэн': 42,
    'взрослый': 42,
    'аниме для взрослых': 42,

    # -----josei----- (43)
    'josei': 43,
    'дзёсей': 43,
    'аниме для женщин': 43,
    'женский': 43,

    # -----new themes----- (100+)
    'team sports': 102,
    'командный спорт': 102,

    'videogames': 103,
    'видеоигры': 103,
    'видео игры': 103,
    'игры': 103,
    'игра': 103,

    'взрослые персонажи': 104,
    'взрослый персонаж': 104,

    'жестокость': 105,
    'жестокий': 105,

    'реинкарнация': 106,
    'реинкарнации': 106,

    'любовный многоугольник': 107,
    'любовные многоугольники': 107,

    'изобразительное искусство': 108,
    'изобразительные искусства': 108,

    'путешествие во времени': 111,
    'путешествия во времени': 111,

    'гэг‑юмор': 112,
    'гэг юмор': 112,

    'удостоено наград': 114,
    'награды': 114,
    'награда': 114,

    'триллер': 115,
    'триллеры': 115,

    'аниме о животных': 116,
    'аниме животных': 116,
    'о животных': 116,
}
